// بادی رو سلکت کردم
let body = document.querySelector('body')
// توپ رو سلکت کردم
let ball = document.querySelector('#ball')
// اسپن جون رو سلکت کردم
let jon = document.querySelector('#jon')
// اینپوت جون رو سلکت کردم
let sorat = document.querySelector('#sorat')


// /\/\/\/\/\/\/\/\/\/\/\/\/\ جابجا کردن توپ /\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\

//بادی رو صدا زدم و گفتم اگه توی بادی دکمه ای از 
// کیبورد کلیک شد برام فانکشن رو اجراکن
body.addEventListener('keydown', (e) => {
    // اگه فانکشن اجرا شد بیا ایف رو برام اجرا کن
    // برابر بود با نام کلید  ،  key اگه 
    // کیبورد پایین عملیاتی که گفتم رو اجرا کن
    if (e.key === 'ArrowDown') {
        // توپ رو صدا زدم و بهش استایل مارجین بالا رو دادم
        // و گفتم از هر جایی که هستی برو پایین
        ball.style.marginTop = '350px'
    }
})

//بادی رو صدا زدم و گفتم اگه توی بادی دکمه ای از 
// کیبورد کلیک شد برام فانکشن رو اجراکن
body.addEventListener('keydown', (e) => {
    // اگه فانکشن اجرا شد بیا ایف رو برام اجرا کن
    // برابر بود با نام کلید  ،  key اگه 
    // کیبورد بالا عملیاتی که گفتم رو اجرا کن
    if (e.key === 'ArrowUp') {
        // توپ رو صدا زدم و بهش استایل مارجین دادم 
        // چون که توپ در مرحله اول بالا صفحه قرار داره 
        // بهش گفتم از هر جایی که هست به سمت بالا حرکت کن
        ball.style.marginTop = '20px'
    }
})

//بادی رو صدا زدم و گفتم اگه توی بادی دکمه ای از 
// کیبورد کلیک شد برام فانکشن رو اجراکن
body.addEventListener('keydown', (e) => {
    // اگه فانکشن اجرا شد بیا ایف رو برام اجرا کن
    // برابر بود با نام کلید  ،  key اگه 
    // کیبورد چپ عملیاتی که گفتم رو اجرا کن
    if (e.key === 'ArrowLeft') {
        // توپ رو صدا زدم و بهش استایل مارجین دادم 
        // و گفتم از هر جایی که هستی به سمت چپ حرکت کن
        ball.style.marginRight = '85%'
    }
})

//بادی رو صدا زدم و گفتم اگه توی بادی دکمه ای از 
// کیبورد کلیک شد برام فانکشن رو اجراکن
body.addEventListener('keydown', (e) => {
    // اگه فانکشن اجرا شد بیا ایف رو برام اجرا کن
    // برابر بود با نام کلید  ،  key اگه 
    // کیبورد راست عملیاتی که گفتم رو اجرا کن
    if (e.key === 'ArrowRight') {
        // توپ رو صدا زدم و بهش استایل مارجین دادم 
        // چون که توپ در مرحله اول سمت راست صفحه قرار داره 
        // بهش گفتم از هر جایی گه هست به سمت راست بره
        ball.style.marginRight = '20px'
    }
})

// اینپوت سرعت رو صدا زدم و گفتم هر وقت که روت کلیک شد 
// بیا فانکشن رو اجرا کن
sorat.addEventListener('click', () => {
    //  مقدار اینپوت سرعت ریختم توی یه متغیر که کار برام آسون بشه
    let x = sorat.value
    // اگه متغیر برابر بود با 1 عملایت رو انجام بده
    if (x == 1) {
        // سرعت توپ رو خیلی زیاد کن
        ball.style.transitionDuration = '10s'
    }
    // اگه متغیر برابر بود با 2 عملایت رو انجام بده
    if (x == 2) {
        // سرعت توپ رو زیاد کن
        ball.style.transitionDuration = '7s'
    }
    // اگه متغیر برابر بود با 3 عملایت رو انجام بده
    if (x == 3) {
        // سرعت توپ رو به حد نرمال بیار 
        ball.style.transitionDuration = '5s'
    }
    // اگه متغیر برابر بود با 4 عملایت رو انجام بده
    if (x == 4) {
        // سرعت توپ رو کم کن
        ball.style.transitionDuration = '3s'
    }
    // اگه متغیر برابر بود با 5 عملایت رو انجام بده
    if (x == 5) {
        // سرعت توپ رو خیلی کم کن
        ball.style.transitionDuration = '1s'
    }
})

// اگه رو توپ کلیک شد فانکشن رو برام اجرا کن
ball.addEventListener('click', () => {
    // یکی از مقدار جون کم کن
    jon.innerHTML -= 1
})